Revit 2026 API

# AssetPropertyGetConnectedProperty Method

---

Gets one connected property with specified index.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public AssetProperty GetConnectedProperty(
	int index
)
```
```vb
Public Function GetConnectedProperty (
	index As Integer
) As AssetProperty
```
```cpp
public:
AssetProperty^ GetConnectedProperty(
	int index
)
```
```fsharp
member GetConnectedProperty :
        index : int -> AssetProperty
```

#### Parameters

index Int32

#### Return Value

AssetProperty The AProperty of that index.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | index is out of range. |

#### Reference

AssetProperty Class

Autodesk.Revit.DB.Visual Namespace